[
{"prayer_eng": ["Fajr"], "athan_time": ["03:43 AM"], "iqama_time": ["04:08 AM"], "prayer_ar": ["الفجر"]},
{"prayer_eng": ["Zuhr"], "athan_time": ["12:59 PM"], "iqama_time": ["01:30 PM"], "prayer_ar": ["الظهر"]},
{"prayer_eng": ["Asr"], "athan_time": ["05:04 PM"], "iqama_time": ["05:30 PM"], "prayer_ar": ["العصر"]},
{"prayer_eng": ["Maghrib"], "athan_time": ["08:33 PM"], "iqama_time": ["08:38 PM"], "prayer_ar": ["المغرب"]},
{"prayer_eng": ["Isha"], "athan_time": ["10:17 PM"], "iqama_time": ["10:22 PM"], "prayer_ar": ["العشاء"]},
{"prayer_eng": ["Jumuʿah"], "athan_time": ["01:00 PM"], "prayer_ar": ["الجمعة"]},
{"event_name": "AMA Al-Bayan School Summer Quran Program", "event_link": "https://events.mymasjid.ca/e/560/summer-quran-program", "event_description": "AMA is excited to announce a Summer Quran memorisation program, keep the momentum going past Ramadan with our Summer Quran Program. Here are the details: Program Objective:Encourage people to memorise, review or improveQuranrecitation during theSummer Age:12+ Gender: Male Date:June, July, and August What isSummerQuranProgram: Participant rules: Halaqa schedule: , point: This is an open Hifz program for all ages who meet the program participant's criteria. , point: Participants can customise their program according to their capability and available time. , point: People can attend any of the Quran's halaqas, they don't have to stick to one shiekh. , point: Each participant has a performance review sheet to track his performance. , point: Reading Arabic words is a must. , point: For the younger age, parents should take care of their kids, before and after recitation, no need to stay for the whole halaqatime. , point: Participants can choose the Surah or Juz to memorise or review during the program time. the plan must be definedbefore the participant is involved in the program. , point: Participants can attend any halaqaand can attend more than one halaqaduring the week, they don't need to stick to one halaqa. , point: A performance sheet must be present with the participant during the halaqa. , point: Saturday:\n , point: Sunday:\n , point: Monday:\n , point: Tuesday:\n , point: Thursday:\n"},
{"event_name": "Classical Arabic Program (Winter 2023)", "event_link": "https://events.mymasjid.ca/e/496/classical-arabic-program-winter-2023-term", "event_description": "We are proud to announce that the Arabic Program is continuing in January 2023! This course will give you a basic foundation for understanding classical Arabic and is divided into multiple parts, beginning with Level 1 for Beginners. This course will be taught by none other than Shaykh Munir Shalghum. To benefit from this course you will need to: You do not need to know how to speak Arabic to enroll in this course. Our teaching method will benefit you even if you cannot speak Arabic. This course is beginner-friendly. Here are the details for the upcoming Winter 2023 semester: Instructor: Sh. Munir Shalghum Date: Class begins on January 30, 2023 Time for Level 1: 8:15 - 9:15 PM each Tuesday and Thursday Time for Level 2: 6:00 - 7:00 PM each Monday and Friday Time for Level 3:  8:15 - 9:15 PM each Monday and Wednesday Time for Level 5: 6:00 - 7:00 PM each Wednesday, and 11:00 AM - 12:00 PM each Saturday Time for Level 8: 7:00 - 8:00 PM each Monday and Wednesday Location: Virtual via Zoom Cost: $350 for the term  , point: Know the Arabic alphabet , point: Be committed to attending the class each and every week , point: Have a goal for wanting to understand the Qur'an without needing an English translation"},
{"event_name": "Quran Class for Convert Women", "event_link": "https://events.mymasjid.ca/e/235/quran-class-for-female-converts", "event_description": "AMA is pleased to offer Quran classes for converts.These classes are designed to teach Beginner level Arabic and Qur'an for new converts to Islam. Classes are separated by gender. Here are the details for the sisters class: Female Instructor:Sister Zienab Date:Every Saturday  Ramdan Time:9:30 AM - 10:30 AM Cost:Free Location:Google Meets"},
{"event_name": "Kids Arabic Halaqa", "event_link": "https://events.mymasjid.ca/e/500/kids-arabic-halaqa", "event_image": "https://events.mymasjid.ca/user_content/event_images/event_image-d6d414baf9d50476c113f2e32dad0bd7.png", "event_description": "You asked and we listened! AMA is pleased to offer our community a Halaqa specifically for young children in Arabic, ages 4 - 8, that will cover the topics of Aqeedah, Ibadah, stories of the Prophets (aws), Lessons from the Quran, Hadith and Seerah of Prophet Muhammad (SAWS) Registration is limited and only those who have been enrolled will be allowed to remain on the premises.\n\nThe Monday Kids Halaqa in Arabic will not take place on long weekends (following OCDSB holidays), nor Ramadan, nor the summertime. The Halaqa schedule will be sent out by email after registration is complete. Parents requested to drop off their child(ren) 5 minutes before the Halaqa starts and pick up their child(ren) within 10 minutes after the Halaqa is finished. Here are the details:\n\nDate: Mondays, starting May 1, 2023 Time: 6:30 PM - 7:30 PM Ages: 4 years old - 8 years old Gender: Both boys and girls Location: AMA Community Centre (1216 Hunt Club) Cost:$5 for each session (between 8 and 10 weeks) Language: Arabic Registration mandatory الموضوع: حلقة للأطفال\nالتاريخ: كل اثنين مساء ابتداء\nالوقت: 6:30 مساء -7:30 مساء\nالأعمار: 4 سنوات - 8 سنوات\nالجنس: كل من الأولاد والبنات\nالعنوان : مركز  مسجد الرحمة 1216 هانت كلوب\nالتكلفة: 5$ لكل فترة بين 8 و 10 أسابيع\nاللغة: العربية\nالتسجيل إلزامي سألتم واستمعنا ! يسرنا أن نقدم لمجتمعنا حلقة مخصصة للأطفال الصغار باللغة العربية ، الذين تتراوح أعمارهم بين 4 و8 سنوات ، والتي ستغطي موضوعات العقيدة ، العبادة ، قصص الأنبياء\n، دروس من القرآن ، الحديث والسيرة النبوية محمد صلى الله عليه وسلم\nالتسجيل محدود ولن يسمح إلا لأولئك الذين تم تسجيلهم بالبقاء في المبنى لن تتم حلقة الاثنين للأطفال باللغة العربية في عطلات نهاية الأسبوع الطويلة (تتبعا لكل عطل  OCDSB), لا رمضان ولا الصيف. سيتم إرسال جدول الحلقة عبر البريد الإلكتروني بعد اكتمال التسجيل يجب على الآباء توصيل أطفالهم قبل 5 دقائق من بدء الحلقة واصطحابهم إلى منازلهم في غضون 10 دقائق بعد انتهاء حلقة جزاكم الله خيرا"},
{"event_name": "Eid ul-Adha Bazaar - Vendor Registration", "event_link": "https://events.mymasjid.ca/e/556/eid-al-adha-bazaar-20231444", "event_description": "Eid ul-Adha is just around the corner – for all your purchase needs, please visit our Bazaar on Saturday, June 24for a wonderful selection of clothing, Islamic merchandise, kids toys, special desserts and more! Date: Saturday, June 24, 2023 Time: 11:00 AM - 7:00 PM Location: AMA Community Hall (1216 Hunt Club Rd) Vendor Booths Cost:$150 (Please purchase 1 ticket per booth) Note: AMA is not responsible for the quality of purchases from the Eid ul-Adha Bazaar Vendor Agreement:"},
{"event_name": "Seniors Fitness Classes", "event_link": "https://events.mymasjid.ca/e/237/fitness-class-for-seniors-women-men", "event_description": "AMA is pleased to offer a fitness class that promotes good health, offers chair exercises, and fosters a fun and positive atmosphere for seniors! Date:Every Wednesday and Friday Time:9:30 AM - 10:30 AM Instructor:RN Dianne Thompson Cost:Free Location:Zoom ** التاريخ: كل أربعاء وجمعة بدءًا من 26 يناير الوقت: 9:30 صباحًا - 10:30 صباحًا مجانا الموقع: زوم"},
{"event_name": "Quran Class for Convert Men", "event_link": "https://events.mymasjid.ca/e/443/quran-class-for-convert-men", "event_description": "Here are the details for the Men's Class: Date: Every Sunday starting September 25 Time: After Dhuhr Prayer (1:30 PM) Location: Masjid Ar-Rahmah Prayer Hall Cost: Free Instructor: Brother Hadi El-Mais"},
{"event_name": "AMA High School Soccer Tournament", "event_link": "https://events.mymasjid.ca/e/546/ama-high-school-soccer-tournament", "event_image": "https://events.mymasjid.ca/user_content/event_images/event_image-625f9d0d570b9fb38ab35eedb5cdd8c3.jpeg", "event_description": "AMA Youth are excited to present the AMA High School Soccer Tournament and barbecue this May to kick start our summer. Here are the details: Age: Boys from Grades 10 to 12 Date: Monday, May 22 Time: 11:30 AM to 7:30 PM Location: Mountain Meadows Park Cost: $100 per team or $15 per player Registration required, BBQ included. If you have any questions, please reach out to us directly by emailing youth@mymasjid.ca , point: Players will not be allowed to register for more than 1 team. , point: If a team has less than 5 players on the field it will be considered a forfeit. , point: There will be no tolerance for any inappropriate language / any fight towards any of the players, referees, or organizers. If any violation occurs it will be up to the referee and the organizers to make a decision."},
{"event_name": "Sh. Munir's Tafseer Halaqa", "event_link": "https://events.mymasjid.ca/e/460/tafseer-halaqa", "event_description": "Join us every Friday as we learn the tafseer of the Holy Qur'an with Sh. Munir Shalghum.  Here are the details: Date: Every Friday starting November 4 Time: 8:00 PM - 9:00 PM Location: Offered in-person at Masjid Ar-Rahmah and virtually via Zoom Ages: Open to all Cost: Free Admission"},
{"event_name": "Boys Fun Contest", "event_link": "https://events.mymasjid.ca/e/549/boys-fun-contest-april-30", "event_image": "https://events.mymasjid.ca/user_content/event_images/event_image-fa834f0183e321c02158972682ddb739.png", "event_description": "Boys Fun Day willresume Sunday, May 7 inshaAllah. AMA Youth invites boys from ages 9 to 13 and up to enjoy a fun and beneficial day on Zoom. Learn about the Seerah of our Beloved Prophet ﷺ and pay close attention as you will be tested at the end with a Kahoot quiz! Winners will receive prizes. Youth should come with the intention of learning beneficial knowledge about the Seerah of the Prophet ﷺ and strive to achieve the best results. Here are the details: Date: Every Sunday Ages: Boys aged 9-13 Location: Online on Zoom Time: 11:00 AM to 12:00 PM Cost: Free Admission Registrants will be sent an email prior to the program containing the Zoom link."},
{"event_name": "Sunday Men's Swimming", "event_link": "https://events.mymasjid.ca/e/553/sunday-mens-swimming-mayjune-2023", "event_description": "AMA's Sunday Men's Swimming is back. Here are the details: Date: Every Sunday from May 7 to June 25 Time: 8:00 PM - 9:00 PM Cost: $25 Location:Brewer Pool"},
{"event_name": "Friday Youth Soccer", "event_link": "https://events.mymasjid.ca/e/550/youth-friday-soccer-may", "event_description": "AMA Youth is back Fridays at 8 to 10 with soccer for youth. Here are the details: Date: Every Friday from May 5 to May 26 Ages: Boys aged 9 - 13 and 14-18 Location: Canterbury High School Time: 8:00 PM to 10:00 PM Cost: $10/month"},
{"event_name": "Boys Fun Day - May 20", "event_link": "https://events.mymasjid.ca/e/551/boys-fun-day", "event_description": "We have a fun event for boys 9 – 13 prepared for you. There will be lots of great activities which include indoor games, and free pizza. Here are the details: Date:Saturday, May 20 Time: 1:30 AM - 5:45 PM (Please bring your child(ren) for dhuhr at the masjid) *Please Note: It is important for parents to pick up their children on time Ages: Boys 9 - 13 years old Location: AMA Community Hall (1216 Hunt Club Rd.) Cost: Free"},
{"event_name": "Women's Fitness Classes", "event_link": "https://events.mymasjid.ca/e/554/womens-fitness-classes-may-june-2023", "event_description": "Are you looking to get healthier with minimal effort? Join us and our instructor, Dianne Thompson, to get fit from the comfort of your own homes. Here are the details: Dates: Every Tuesday and Thursday starting May 9 - June 29 Time: 7:00 PM - 8:00 PM Instructor: Dianne Thompson Location: Online via Zoom Cost: $40 for 16 classes. That's $2.5 per class only! Please print and fill out the following mandatory form and send it tosisters@mymasjid.cabefore the first session: [https://drive.google.com/file/d/1T-yiUK_uwQKSs3ltQ5TBzBh2l5rXsy2G/view](https://drive.google.com/file/d/1T-yiUK_uwQKSs3ltQ5TBzBh2l5rXsy2G/view) If you're pregnant, please fill out this form: [https://drive.google.com/file/d/1_ZigHxSmPSXn9HKKCnof3bTBbZP_pLdc/view](https://drive.google.com/file/d/1_ZigHxSmPSXn9HKKCnof3bTBbZP_pLdc/view)"},
{"event_name": "Brothers' Fitness Classes", "event_link": "https://events.mymasjid.ca/e/558/brothers-fitness-program", "event_description": "Abu Huraira reported Allah's Messenger (ﷺ) as saying: 'A strong believer is better and is more lovable to Allah than a weak believer' (Sahih Muslim 2664) Join us every Saturday at AMA Centre to develop your strength and stamina through a range of exercises designed for all fitness levels. All brothers are welcome regardless of fitness level. Here are the details: Date: Every Saturday Time: 9:00 AM - 11:30 AM Location: AMA Community Centre Cost: Free To register, please click the button below:"}
]